In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(4, 3), ['a', 'b', 'c', 'd'], ['X', 'W', 'Z'])

In [4]:
df

          X         W         Z
a -1.727678  1.621868  1.031224
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [6]:
bool_df = df > 0

In [7]:
bool_df

       X      W      Z
a  False   True   True
b  False   True  False
c  False  False  False
d  False  False  False

In [8]:
df[bool_df]

    X         W         Z
a NaN  1.621868  1.031224
b NaN  0.528791       NaN
c NaN       NaN       NaN
d NaN       NaN       NaN

In [9]:
df[df>0]

    X         W         Z
a NaN  1.621868  1.031224
b NaN  0.528791       NaN
c NaN       NaN       NaN
d NaN       NaN       NaN

In [10]:
df

          X         W         Z
a -1.727678  1.621868  1.031224
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [12]:
df['W'] > 1

a     True
b    False
c    False
d    False
Name: W, dtype: bool

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
df[df['W'] > 1]

          X         W         Z
a -1.727678  1.621868  1.031224

In [15]:
df

          X         W         Z
a -1.727678  1.621868  1.031224
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [18]:
res_df = df[df['Z'] < 0]

In [19]:
res_df

          X         W         Z
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [20]:
res_df['Z']

b   -0.943997
c   -1.227551
d   -0.786138
Name: Z, dtype: float64

In [24]:
df[df['Z'] < 0][['Z', 'X']]

          Z         X
b -0.943997 -0.105616
c -1.227551 -0.048831
d -0.786138 -0.541552

In [25]:
bool_ser = df['Z'] < 0

In [26]:
bool_ser

a    False
b     True
c     True
d     True
Name: Z, dtype: bool

In [27]:
result_df = df[bool_ser]

In [28]:
result_df

          X         W         Z
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [29]:
result_df[['Z', 'X']]

          Z         X
b -0.943997 -0.105616
c -1.227551 -0.048831
d -0.786138 -0.541552

In [30]:
df

          X         W         Z
a -1.727678  1.621868  1.031224
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [31]:
df[(df['X'] > 0) & (df['Z'] < 0)]

Empty DataFrame
Columns: [X, W, Z]
Index: []

In [32]:
df[(df['X'] > 0) | (df['Z'] < 0)]

          X         W         Z
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [33]:
df

          X         W         Z
a -1.727678  1.621868  1.031224
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [34]:
df.reset_index()

  index         X         W         Z
0     a -1.727678  1.621868  1.031224
1     b -0.105616  0.528791 -0.943997
2     c -0.048831 -1.879113 -1.227551
3     d -0.541552 -1.652034 -0.786138

In [35]:
df

          X         W         Z
a -1.727678  1.621868  1.031224
b -0.105616  0.528791 -0.943997
c -0.048831 -1.879113 -1.227551
d -0.541552 -1.652034 -0.786138

In [36]:
z1 = [2, 3, 5, 6]

In [37]:
df['Z1'] = z1

In [38]:
df

          X         W         Z  Z1
a -1.727678  1.621868  1.031224   2
b -0.105616  0.528791 -0.943997   3
c -0.048831 -1.879113 -1.227551   5
d -0.541552 -1.652034 -0.786138   6

In [39]:
df.set_index('Z1')

           X         W         Z
Z1
2  -1.727678  1.621868  1.031224
3  -0.105616  0.528791 -0.943997
5  -0.048831 -1.879113 -1.227551
6  -0.541552 -1.652034 -0.786138

In [40]:
df

          X         W         Z  Z1
a -1.727678  1.621868  1.031224   2
b -0.105616  0.528791 -0.943997   3
c -0.048831 -1.879113 -1.227551   5
d -0.541552 -1.652034 -0.786138   6